#### ImportSymbolBaseLevelInvalid Property

---

|  |
| --- |
| BuiltInFailures ImportFailures Class   See Also |

An import instance has become invalid. The host work plane of the import can no longer be used. Click "Rehost" to maintain the position of the import and rehost its work plane to the lowest level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ImportSymbolBaseLevelInvalid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ImportSymbolBaseLevelInvalid As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ImportSymbolBaseLevelInvalid { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ImportFailures Class

Autodesk.Revit.DB Namespace